package main

import "fmt"

// додаємо * перед типом, бо без неї не можна буде змінити значення змінної
func change(str *string) {
	*str = "Hello World"
}


// main
func pointers() {
	// вказівник це адреса змінної в пам'яті
	a := 5
	pointer := &a
	fmt.Println(pointer)
	// виведе 0xc00001e0b8 це ім'я ячейки в пам'яті, де зберігається змінна "а"

	// а якщо нам треба отримати значення змінної, а не ім'я ячейки, треба поставити * (оператор розіменування)
	fmt.Println(*pointer)
	// виведе 5, або можна ще записати fmt.Println(*&a)



	                       // використовуємо функцію вище
	s := "Hello"
	fmt.Println(s)
	change(&s)
	fmt.Println(s)
	// або 
	// var point *string = &s 
	// fmt.Println(point)

	// якщо змінювати значення змінної без вказівника, то буде створюватись копія змінної і в неї буде змінюватись значення, а за допомогою вказівника ми змінимо ту саму змінну


	num := 9
	b := &num //адреса ячейки
	fmt.Println(*b) // виведе 9
	*b = 35 //змінюємо змінну b
    fmt.Println(*b) // виведе 35
}